sargent.org
**** Definitions
- The *precision* of an estimate is often found by taking the reciprocal of the estimated variance.
**** Applications and Algorithms
***** Cagan and Friedman "adaptive expectations"
These two guys, in 1956, posited that when people wanted to form expectations about future values of a scalar $y_t$, they would use the following adaptive expectations scheme: $$y_{t+1}^{\star} = (1 -K) y_{t}^{\star} + K y_t$$
***** Muth's reverse engineering                                    :INC:
In 1960 Muth decided he wanted to know under what stochastic processes the Cagan and Friedman adaptive expectation rule would be optimal. He decided to do it backwards and start with the forecasting scheme and then he would back out the underlying optimal stochastic processes for that scheme. We use the Kalman filter to do the same thing.

The model we use is

\begin{align}
x_{t+1} &= x_t + w_{t+1} \\
y_t &= x_t + v_t
\end{align}

where $y_t$, $x_t$ are scalar random processes, and $w_{t+1}$ ,$v_t$ are mutually4independent i.i.d. Gaussian random processes with means of zero and variances $Ew^2_{t+1} = Q$, $Ev_t^2 = R$, and $Ev_sw_{t+1} = 0  \forall t, s$.

In this problem $A = 1$ $CC' = Q$, and $G = 1$.

SEE THE BOOK FOR MORE; it is too much to type, but it is straightforward.
*** COMMENT Vector autoregressions and the Kalman filter
**** Definitions                                                  :MATLAB:
- A *time-invariant* matrix $\Sigma_t = \Sigma$ that solves the Ricatti equation is the covariance of $x_t$ around $Ex_t|\{y_{-\infty}^{t-1}\}$, where $\{y_{-\infty}^{t-1}\}$ denotes the semi-infinite history of $y_s$ for add dates on or before $t-1$. (Matlab program ~kfilter.m~)
**** Algorithms and Applications
***** Interpreting VARs
Most economic models are in the form of the state space system:

\begin{align}
x_{t+1} &= A_0 x_t + C w_{t+1} \\
y_t = G x_t + v_t
\end{align}

This hidden Markov model disturbs the evolution of the state $x_t$ by the $p x 1$ shock vector $w_{t+1}$ and it them perturbs the $m x 1$ vector of observed variables by the $m x 1$ vector of measurement errors $v_t$. Therefore, $p+m$ shocks affect $y_t$. Good economic theory gives explanation for these shocks.

Time invariant version of the state space system comes from the Kalman filter and is:

\begin{align}
\hat{x}_{t+1} &= Z_0 \hat{x}_t + K a_t \\
y_t &= G \hat{x}_t a_t
\end{align}

This representation represents the exact same process $y_t$ in terms of an $m x 1$ vector of shocks a_t that are recovered by running an infinite-order (population) VAR for $y_t$. The Kalman filter provides a mapping between the two representations and is therefore a very useful tool for interpreting VARs.

*** COMMENT More Estimation
**** Definitions
- The *likelihood function* for the variable $y_t$ we have been working with is $$F(y_T, \dots, y_0) = f(y_t|Y^{T-1})f(y_{t-1}|y^{T-2}) \cdots f(y_1|y_0) f(y_0)$$
- The *log of the conditional density function* of the $m x 1$ vector $y_t$ is $$\log f(y_t|Y^{t-1}) = -0.5m \log(2 \pi) - 0.5 \log \text{det} (\Omega_t) - 0.5 a_t' \Omega_t^{-1} a_t$$
**** Algorithms and Applications
***** Bayesian posterior
The likelihood function and the log of the conditional density function can be used in conjunction with the Kalman filter recursion to estimate parameters $\theta$ underlying the matrices $A_0, G, C, R$.

The only other piece of the puzzle that is un-accounted for is the representation of Bayes' law in terms of our parameter vector $\theta$, our data $y_0^T$, and the prior distribution for $\theta$ $\tilde{p}(\theta)$. That appears below in the form of the posterior distribution for $\theta$: $$ \tilde{p}(\theta|y_0^T) = \frac{f(y_0^T | \theta) \tilde{p}(\theta)}{\int f(y_0^T | \theta) \tilde{p}(\theta) d \theta}$$

The denominator in the equation above is the marginal joint density ($f(t_O^T)$) of $y_0^T$.
*** COMMENT The spectrum
**** Definitions
- The *spectral density matrix* (commonly represented as $S_x(\omega)$) is a special complex-valued matrix which can contain all the second moments for a covariance stationary stochastic process. It and the auto-covariance matrix can be used to determine the other if one is unknown.
**** Applications and Algorithms
***** Fourier inversion                                         :PHYSICS:
It is interesting to note that the auto-covariance matrix and the spectral density matrix are simply the Fourier and inverse Fourier transform of one another. That being said, here are some expressions for $C_x(\tau)$ and $S_x(\omega)$


\begin{align}
C_x(\tau) &= \frac{1}{2 \pi} \int_{-\pi}^{\pi} S_x(\omega) e^{+ i \omega \tau} d \omega \\
S_x(\omega) &= \sum_{\tau= - \infty}^{\infty} C_x(\tau) e ^{- i \omega \tau}
\end{align}

Obviously, we could use the expressions above to determine $C_x(0)$ and $S_x(0)$ by setting $\tau$ and $\omega$ equal to zero in the right places and watching the exponentials drop out.

Note that although one is a sum and one is an intergral, these are still the Fourier and inverse Fourier transform of one anohter. The reason is that we only have $C_x(\tau)$ for discrete values of $\tau$, so we need a summation of them to get $S_x(\omega)$, which is defined continuously across all $\omega$.
***** Example                                                    :MATLAB:
As an example, Matlab the program =bigshow2.m= computes the impulse response, spectrum, covariogram, and sample path of 4 different processes. I could move it to python, but why?
*** COMMENT The Linear Quadratic (LQ) permanent income model
**** Definitions
**** Algorithms and Applications
***** DONE review how they derived equation 2.12.7
CLOSED: [2013-07-11 Thu 19:50]
:PROPERTIES:
:ID:       6F8503D3-90CA-4E6E-9162-D2AEAAB2FF33
:END:
**** Theorems
**** Other Notes
** COMMENT Technical Appendix A: Functional Analysis
*** Definitions
- A sequence $\{x-n\}$ in a metric space $(X, d)$ is said to *converge* to a limit $x_0 \in X$ if for every $\varepsilon > 0$ there exists an $N(\varepsilon)$ such that $d(x_n, x_0) < \varepsilon$ for $n \ge N(\varepsilon)?
  - What is this $N$ thing?
- A metric space $(X, d)$ is said to be *complete* if each Cauchy sequence in $(X, d)$ is a convergent sequence in $(X, d)$. That is in a complete metric space each Cauchy sequence converges to a point belonging to the metric space.
- An *operator* is a function $f$ mapping a metric space $(X, d)$ into itself.
- A *contraction* is a function that has the property that for some real number $0\le k < 1$ and a metric space ($X, d$) $d[f(x), f(y)] \le k d(x, y) \forall x, y, \in X$.
*** Theorems
**** Cauchy sequence in metric space
Let $\{x_n\}$ be a convergent sequence in a metric space ($X, d$). Then $\{x_n\}$ is a Cauchy sequence.
**** Contraction mapping theorem
Let $(X, d)$ be ac omplete metrix space and let $f: X \rightarrow X$ be a contraction. Then there is a unique point  $x_0 in X$ such that $f(x_0) = x_0$. Furthermore, if $x$ is any point in $X$ and $\{x_n\}$ is defined inductively according to $x_1= f(x), x_2 = f(x_1) \dots$, then $\{x_n\}$ converges to $x_0$
**** Blackwell's Sufficient Conditions for T to be a contraction
Let $T$ be an operator on a mertic space $(X, d_{\infty}$, where #X# is a space of functions. Assume that $T$ has the following two properities

1. Monotonicity: for and #x, y \in X, x \ge y$ implies that $T(x) \ge T(y)$
2. Discounting: Let $c$ denote a function that is constant at the real value $c$ for all points in the domain of definition of the function in X$. For any positive real $c$ and ever $x \in X, T(x+c) \le T(c) + \beta c$ for some $\beta$ satisfying 0 \le \beta < 1. Then $T$ is
*** Algorithms and Applications
**** Policy improvement algorithm
We want to study the discoutned dynamic programming problem:

\begin{align}
v(x) = \max_{u \in R^k} \{r(x, u) + \beta v(x')\}, \quad x' \le g(x, u), \quad 0 < \beta < 0
\end{align}

The operator $T$ is defined as follows: $$ Tv = \max_{u \in R^k} \{ r(x, u) + \beta v(x')\}, \quad x' \le g(x, u), \quad x \in X$$

We will work with the complete metric space $(X, d_{\infty})$ where  $X$ is the space of continuous bounded functions mapping $X$ to the real line and $d_{\infty}(v, w) = \sup_{x\in X}|v(x) - w(x)|$.

In the chosen metric space, it is easy to show that $T$ is a contraction by verifying Blackwell's sufficient conditions.

The operator $T_{\mu}$ is defined as follows (note for simplicity we allow the constraint to hold with equality. i.e. we say that $x' = g(x,  u)$):

\begin{align}
T_{\mu}(v) &= T(v) \\
t_{\mu}(v) &= f[x, \mu(x)] + \beta v\{g[x, \mu(x)]\}
\end{align}

where $\mu(x)$ is the policy function that attains $T(v)(x)$. It is also easy to verify Blackwell's conditions for $T_{\mu}$

The Howard improvement algorithm is defined as follows:

Let $v_{\mu}(x) = T_{\mu}[v_{\mu}(x)]. Define a new policy $\bar{\mu}$ and an associated operator $T_{\bar{\mu}}$ by

$$T_{\bar{\mu}}[v_{\mu}(x)] = T[v_{\mu}(x)]$$

This means that $\bar{\mu}$ is the policy that solves a one-period problem with $v_{\mu}(x)$ as the terminal value function. Compute the fixed point

$$V_{\bar{\mu}} = T_{\bar{\mu}}[v_{\bar{\mu}}(x)]$$

Then $v_{\bar{\mu}}(x) \ge v_{\mu}(x)$. If $\mu(x)$ is not optimal, then $v_{\bar{\mu}} > v_\mu(x)$ for at least one $x \in X$.
** COMMENT Technical Appendix: Linear Projections and Hidden Markov Models
*** Definitions
- A *linear projection of $Y$ on $X$* is the estimator of $Y$ that is a linear function of $X$ that minimized the mean sum of squared errors between each component in $Y$ and its estimate. (least squares)
- A *hidden Markov model* is a model that has un-observable state variables, but has observable variables that are a function of the hidden state. They can be represented in the form of the canonical linear state-space system.
** Chapter 11: Fiscal Policies in a Growth Model
*** Non-stochastic model
General Items:

- No uncertainty (non-stochastic) and decision makers all have perfect foresight.
**** Households and Technology

There is a representative household that maximizes over non-negative streams of a single consumption good $c_t$ and leisure $1 - n_t$. The ordering is given by $$\sum_{t=0}^{\infty} \beta^t U(c_t, 1 - n_t), \quad \beta \in (0, 1)$$  where $U$ is strictly increasing in $c_t$ and $1 - n_t$, twice continuously differentiable and strictly concave. We require that $c_t \ge 0$ and that $n_t \in [0, 1]$. For now we will assume that $$U(c, t - n) = u(c) + u(1 - n).

Technology is
\begin{align}
 g_t + c_t + x_t &\le F(k_t, n_t) \\
k_{t+1} &= (1 - \delta) k_t + x_t
\end{align}
Where $\delta \in (0, 1)$ is a depreciation rate, $K_t$ is the stock of physical capital, $x_t$ is gross investment and $F(k, n)$ is a linearly homogeneous production function with positive and decreasing marginal products of capital and labor. This can be simplified to a single by substituting out the $x_4: $$g_t + c_t + k_{t+1} \le F(k_t, n_t)  + (1 - \delta) k_t$$
