sargent.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>sargent</title>
<!-- 2013-07-21 Sun 16:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

</head>
<body>
<div id="content">
<h1 class="title">sargent</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Rtm4</a>
<ul>
<li><a href="#sec-1-1">1.1. Chapter 11: Fiscal Policies in a Growth Model</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Non-stochastic model</a>
<ul>
<li><a href="#sec-1-1-1-1">1.1.1.1. Households and Technology</a></li>
<li><a href="#sec-1-1-1-2">1.1.1.2. Equilibrium</a></li>
<li><a href="#sec-1-1-1-3">1.1.1.3. Term structure of interest rates</a></li>
<li><a href="#sec-1-1-1-4">1.1.1.4. Equilibrium</a></li>
</ul>
</li>
<li><a href="#sec-1-1-2">1.1.2. Term structure of interest rates</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Marching Orders, number 1 <code>[4/4]</code></a>
<ul>
<li><a href="#sec-2-1">2.1. Read Chapter 2 of RMT4</a></li>
<li><a href="#sec-2-2">2.2. Read the two techincal appendixes</a></li>
<li><a href="#sec-2-3">2.3. Work exercises 2.1-2.5</a></li>
<li><a href="#sec-2-4">2.4. Think of python examples</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. Re-create <code>markov.m</code> and other Matlab programs</a></li>
<li><a href="#sec-2-4-2">2.4.2. Add Baysean estimation to dolo.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Other Tasks</a></li>
<li><a href="#sec-4">4. z-transform  <code>[1/2]</code></a>
<ul>
<li><a href="#sec-4-1">4.1. Read Z-transform document</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Notes</a></li>
<li><a href="#sec-4-1-2">4.1.2. Tom's PV Notes</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Teaching module</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Dynare -&gt; python = dolo <code>[0/2]</code></a>
<ul>
<li><a href="#sec-5-1">5.1. Read RMT4 chapter 11</a></li>
<li><a href="#sec-5-2">5.2. Matlab+Dynare -&gt; python+dolo</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Marching orders, number 2</a>
<ul>
<li><a href="#sec-6-1">6.1. Read RMT4 Chapter 11</a></li>
<li><a href="#sec-6-2">6.2. Work problems RMT4 2.6, 2.10. 2.14, 2.17, 2.20, 2.24</a></li>
<li><a href="#sec-6-3">6.3. Replicate figure 11.9.1 in RMT4 (page 401)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a id="ID-C5EF6281-CA55-40A9-A689-6E9A060412DC" name="ID-C5EF6281-CA55-40A9-A689-6E9A060412DC"></a><span class="section-number-2">1</span> Rtm4</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Chapter 11: Fiscal Policies in a Growth Model</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Non-stochastic model</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
General Items:
</p>

<ul class="org-ul">
<li>No uncertainty (non-stochastic) and decision makers all have perfect foresight.
</li>
</ul>
</div>
<div id="outline-container-sec-1-1-1-1" class="outline-5">
<h5 id="sec-1-1-1-1"><span class="section-number-5">1.1.1.1</span> Households and Technology</h5>
<div class="outline-text-5" id="text-1-1-1-1">
<p>
There is a representative household that maximizes over non-negative streams of a single consumption good \(c_t\) and leisure \(1 - n_t\). The ordering is given by $$\sum_{t=0}^{\infty} \beta^t U(c_t, 1 - n_t), \quad \beta \in (0, 1)$$  where \(U\) is strictly increasing in \(c_t\) and \(1 - n_t\), twice continuously differentiable and strictly concave. We require that \(c_t \ge 0\) and that \(n_t \in [0, 1]\). For now we will assume that $$U(c, t - n) = u(c) + u(1 - n).
</p>

<p>
Technology is
</p>
\begin{align}
 g_t + c_t + x_t &\le F(k_t, n_t) \\
k_{t+1} &= (1 - \delta) k_t + x_t
\end{align}
<p>
Where \(\delta \in (0, 1)\) is a depreciation rate, \(K_t\) is the stock of physical capital, \(x_t\) is gross investment and \(F(k, n)\) is a linearly homogeneous production function with positive and decreasing marginal products of capital and labor. This can be simplified to a single by substituting out the $x<sub>4</sub>: $$g_t + c_t + k_{t+1} \le F(k_t, n_t)  + (1 - \delta) k_t$$
</p>
</div>
</div>
