sargent.org
**** Equilibrium
The household owns capital, makes investment decisions, and rents capital and labor to the firm. There is a price system that is a triple of sequences: $\{ q_t, \eta_t, w_t \} _{t=0}^{\infty}$ where $q_t$ is the time 0 pre-tax price of one unit of investment at time t ($x_t$ or $c_t$), $\eta_t$ is the pre-tax time at time $t$, that household receives from renting capital to the firm in period $t$, and @w_t@ is the pre-tax labor wage.

In equilibrium the household faces the budget constraint

$$\sum_{t=0}^{\infty} q_t \{(1 + \tau_{ct})c_t + [k_{t+1} - (1 - \delta)k_t]\} \le \sum_{t=0}^{\infty} q_t \{ \eta_t k_t - \tau_{kt}(\eta_t  - \delta_t)k_t + (1 - \tau_{nt})w_t n_t - \tau_{ht}\}$$

The government has a budget constraint $$\sum_{t=0}^{\infty} q_t g_t \le \sum_{t=0}^{\infty} q_t \{ \tau_{ct}c_T + \tau_{kt}(\eta_t - \delta) k_t + \tau_{nt} w_t n_t + \tau_{ht}\}$$
**** Term structure of interest rates
The prices system $\{q_t\}_{t=0}^{\infty}$ maximizes over non-negative streams of a single consumption good $c_t$ and leisure $1 - n_t$. The ordering is given by $$\sum_{t=0}^{\infty} \beta^t U(c_t, 1 - n_t), \quad \beta \in (0, 1)$$  where $U$ is strictly increasing in $c_t$ and $1 - n_t$, twice continuously differentiable and strictly concave. We require that $c_t \ge 0$ and that $n_t \in [0, 1]$. For now we will assume that $$U(c, t - n) = u(c) + u(1 - n).

Technology is
\begin{align}
 g_t + c_t + x_t &\le F(k_t, n_t) \\
k_{t+1} &= (1 - \delta) k_t + x_t
\end{align}
Where $\delta \in (0, 1)$ is a depreciation rate, $K_t$ is the stock of physical capital, $x_t$ is gross investment and $F(k, n)$ is a linearly homogeneous production function with positive and decreasing marginal products of capital and labor. This can be simplified to a single by substituting out the $x_4: $$g_t + c_t + k_{t+1} \le F(k_t, n_t)  + (1 - \delta) k_t$$
**** Equilibrium
The household owns capital, makes investment decisions, and rents capital and labor to the firm. There is a price system that is a triple of sequences: $\{ q_t, \eta_t, w_t \} _{t=0}^{\infty}$ where $q_t$ is the time 0 pre-tax price of one unit of investment at time t ($x_t$ or $c_t$), $\eta_t$ is the pre-tax time at time $t$, that household receives from renting capital to the firm in period $t$, and @w_t@ is the pre-tax labor wage.

In equilibrium the household faces the budget constraint

$$\sum_{t=0}^{\infty} q_t \{(1 + \tau_{ct})c_t + [k_{t+1} - (1 - \delta)k_t]\} \le \sum_{t=0}^{\infty} q_t \{ \eta_t k_t - \tau_{kt}(\eta_t  - \delta_t)k_t + (1 - \tau_{nt})w_t n_t - \tau_{ht}\}$$

The government has a budget constraint $$\sum_{t=0}^{\infty} q_t g_t \le \sum_{t=0}^{\infty} q_t \{ \tau_{ct}c_T + \tau_{kt}(\eta_t - \delta) k_t + \tau_{nt} w_t n_t + \tau_{ht}\}$$
*** Term structure of interest rates
The prices system $\{q_t\}_{t=0}^{\infty}$ evidently embeds within it a term structure of interest rates. It is convenient to represent $q_t$ as

\begin{align}
q_t &= q_0 \frac{q_1}{1_0} \frac{q_2}{q_1} \cdots \frac{q_t}{q_{t-1}} \\
&= q_0 m_{0, 1} m_{0, 2} \cdots m_{t-1, t}
\end{align}

where $m_{t, t+1} = \frac{q_{t+1}}{q_t}$. We can represent the one-period discount factor $m_{t, t+1}$ as $$m_{t, t+1} = R_{t, t+1}^{-1} = \frac{1}{1 + r_{t, t+1}} \approx \exp(-r_{t, t+1})$$

THERE IS MUCH MORE IN THE BOOK, BUT I HAVE PRETTY MUCH BEEN WRITING EVERYTHING AND THAT IS DUMB
* DONE [#A] Marching Orders, number 1 [4/4]
CLOSED: [2013-07-13 Sat 12:48]
# Clock in C-c C-x C-i
# Clock out C-c C-x C-o
# Re-evaluate time range (if manually changed) C-c C-y
# Show times for each task C-c C-x C-d
# Generate time report table C-c C-x C-r
# Update clock table C-c C-x C-u

#+BEGIN: clocktable :maxlevel 3 :scope subtree
#+CAPTION: Clock summary at [2013-07-18 Thu 00:36]
| Headline                                | Time      |       |
|-----------------------------------------+-----------+-------|
| *Total time*                            | *1d 6:46* |       |
|-----------------------------------------+-----------+-------|
| DONE [#A] Marching Orders, number 1...  | 1d 6:46   |       |
| \__ DONE [#A] Read Chapter 2 of RMT4    |           | 17:42 |
| \__ DONE [#B] Read the two techincal... |           |  1:13 |
| \__ DONE [#A] Work exercises 2.1-2.5    |           | 11:51 |
#+END:

  DEADLINE: <2013-07-14 Sun>
:PROPERTIES:
:ID:       465B4AC3-AE20-4255-A252-CCABA15ECC0F
:END:
** DONE [#A] Read Chapter 2 of RMT4
CLOSED: [2013-07-13 Sat 09:54]
CLOCK: [2013-07-13 Sat 09:34]--[2013-07-13 Sat 09:54] =>  0:20
CLOCK: [2013-07-11 Thu 12:42]--[2013-07-11 Thu 13:13] =>  0:31
CLOCK: [2013-07-11 Thu 11:49]--[2013-07-11 Thu 12:31] =>  0:42
CLOCK: [2013-07-10 Wed 11:08]--[2013-07-10 Wed 12:00] =>  0:52
CLOCK: [2013-07-09 Tue 15:58]--[2013-07-09 Tue 16:00] =>  0:02
CLOCK: [2013-07-09 Tue 14:44]--[2013-07-09 Tue 14:59] =>  0:15
CLOCK: [2013-07-08 Mon 15:41]--[2013-07-08 Mon 16:24] =>  0:43
CLOCK: [2013-07-08 Mon 12:15]--[2013-07-08 Mon 12:46] =>  0:31
CLOCK: [2013-07-08 Mon 09:29]--[2013-07-08 Mon 10:34] =>  1:05
CLOCK: [2013-07-08 Mon 08:35]--[2013-07-08 Mon 09:22] =>  0:47
CLOCK: [2013-07-06 Sat 16:17]--[2013-07-06 Sat 16:30] =>  0:13
CLOCK: [2013-07-06 Sat 15:37]--[2013-07-06 Sat 16:05] =>  0:28
CLOCK: [2013-07-06 Sat 11:22]--[2013-07-06 Sat 12:11] =>  0:49
CLOCK: [2013-07-06 Sat 10:06]--[2013-07-06 Sat 10:58] =>  0:52
CLOCK: [2013-07-06 Sat 09:11]--[2013-07-06 Sat 09:48] =>  0:37
CLOCK: [2013-07-05 Fri 22:40]--[2013-07-05 Fri 23:15] =>  0:35
CLOCK: [2013-07-05 Fri 20:24]--[2013-07-05 Fri 20:44] =>  0:20
CLOCK: [2013-07-03 Wed 14:54]--[2013-07-03 Wed 15:25] =>  0:31
CLOCK: [2013-07-03 Wed 12:06]--[2013-07-03 Wed 12:25] =>  0:19
CLOCK: [2013-07-02 Wed 23:05]--[2013-07-03 Wed 01:35] =>  2:30
CLOCK: [2013-06-29 Sat 13:20]--[2013-06-29 Sat 18:00] =>  4:40
:PROPERTIES:
:ID:       760A6784-366A-4821-93C7-2CEAFB536B46
:END:

I should probably look over section 2.4.5.2 again. It was a bit
complicated and I couldn't replicate its results on my own.

** DONE [#B] Read the two techincal appendixes
CLOSED: [2013-07-13 Sat 12:48]
CLOCK: [2013-07-13 Sat 12:01]--[2013-07-13 Sat 12:48] =>  0:47
CLOCK: [2013-07-13 Sat 09:54]--[2013-07-13 Sat 10:20] =>  0:26
:PROPERTIES:
:ID:       39103168-00D5-4C92-A89B-28735E991612
:END:
** DONE [#A] Work exercises 2.1-2.5
CLOSED: [2013-07-11 Thu 17:40]
CLOCK: [2013-07-11 Thu 15:18]--[2013-07-11 Thu 17:40] =>  2:22
CLOCK: [2013-07-11 Thu 10:12]--[2013-07-11 Thu 11:47] =>  1:35
CLOCK: [2013-07-10 Wed 14:32]--[2013-07-10 Wed 16:53] =>  2:21
   CLOCK: [2013-07-08 Mon 15:28]--[2013-07-08 Mon 15:41] =>  0:13
   CLOCK: [2013-07-08 Mon 12:46]--[2013-07-08 Mon 15:20] =>  2:34
   CLOCK: [2013-07-06 Sat 16:05]--[2013-07-06 Sat 16:17] =>  0:12
   CLOCK: [2013-07-06 Sat 15:03]--[2013-07-06 Sat 15:37] =>  0:34
   CLOCK: [2013-07-06 Sat 13:15]--[2013-07-06 Sat 14:51] =>  1:36
   CLOCK: [2013-07-06 Sat 10:58]--[2013-07-06 Sat 11:22] =>  0:24
:PROPERTIES:
:ID:       A9654E4F-F041-40C0-B858-2AC5372AA8D2
:END:
** DONE [#B] Think of python examples
CLOSED: [2013-07-13 Sat 12:48]
:PROPERTIES:
:ID:       1B53EA77-B3C1-4564-AEFD-60DC37A6B19D
:END:

*** HOLD Re-create =markov.m= and other Matlab programs      :WAITING:HOLD:
- State "HOLD"       from "WAITING"    [2013-07-13 Sat 09:55] \\
  Talk with Tom about this first
:PROPERTIES:
:ID:       804E4C2C-BE54-4DD8-AB4A-7F8D22676AED
:END:

