sargent.html

<div id="outline-container-sec-1-1-1-2" class="outline-5">
<h5 id="sec-1-1-1-2"><span class="section-number-5">1.1.1.2</span> Equilibrium</h5>
<div class="outline-text-5" id="text-1-1-1-2">
<p>
The household owns capital, makes investment decisions, and rents capital and labor to the firm. There is a price system that is a triple of sequences: \(\{ q_t, \eta_t, w_t \} _{t=0}^{\infty}\) where \(q_t\) is the time 0 pre-tax price of one unit of investment at time t (\(x_t\) or \(c_t\)), \(\eta_t\) is the pre-tax time at time \(t\), that household receives from renting capital to the firm in period \(t\), and @w<sub>t</sub>@ is the pre-tax labor wage.
</p>

<p>
In equilibrium the household faces the budget constraint
</p>

<p>
$$\sum_{t=0}^{\infty} q_t \{(1 + \tau_{ct})c_t + [k_{t+1} - (1 - \delta)k_t]\} \le \sum_{t=0}^{\infty} q_t \{ \eta_t k_t - \tau_{kt}(\eta_t  - \delta_t)k_t + (1 - \tau_{nt})w_t n_t - \tau_{ht}\}$$
</p>

<p>
The government has a budget constraint $$\sum_{t=0}^{\infty} q_t g_t \le \sum_{t=0}^{\infty} q_t \{ \tau_{ct}c_T + \tau_{kt}(\eta_t - \delta) k_t + \tau_{nt} w_t n_t + \tau_{ht}\}$$
</p>
</div>
</div>

<div id="outline-container-sec-1-1-1-3" class="outline-5">
<h5 id="sec-1-1-1-3"><span class="section-number-5">1.1.1.3</span> Term structure of interest rates</h5>
<div class="outline-text-5" id="text-1-1-1-3">
<p>
The prices system \(\{q_t\}_{t=0}^{\infty}\) maximizes over non-negative streams of a single consumption good \(c_t\) and leisure \(1 - n_t\). The ordering is given by $$\sum_{t=0}^{\infty} \beta^t U(c_t, 1 - n_t), \quad \beta \in (0, 1)$$  where \(U\) is strictly increasing in \(c_t\) and \(1 - n_t\), twice continuously differentiable and strictly concave. We require that \(c_t \ge 0\) and that \(n_t \in [0, 1]\). For now we will assume that $$U(c, t - n) = u(c) + u(1 - n).
</p>

<p>
Technology is
</p>
\begin{align}
 g_t + c_t + x_t &\le F(k_t, n_t) \\
k_{t+1} &= (1 - \delta) k_t + x_t
\end{align}
<p>
Where \(\delta \in (0, 1)\) is a depreciation rate, \(K_t\) is the stock of physical capital, \(x_t\) is gross investment and \(F(k, n)\) is a linearly homogeneous production function with positive and decreasing marginal products of capital and labor. This can be simplified to a single by substituting out the $x<sub>4</sub>: $$g_t + c_t + k_{t+1} \le F(k_t, n_t)  + (1 - \delta) k_t$$
</p>
</div>
</div>

<div id="outline-container-sec-1-1-1-4" class="outline-5">
<h5 id="sec-1-1-1-4"><span class="section-number-5">1.1.1.4</span> Equilibrium</h5>
<div class="outline-text-5" id="text-1-1-1-4">
<p>
The household owns capital, makes investment decisions, and rents capital and labor to the firm. There is a price system that is a triple of sequences: \(\{ q_t, \eta_t, w_t \} _{t=0}^{\infty}\) where \(q_t\) is the time 0 pre-tax price of one unit of investment at time t (\(x_t\) or \(c_t\)), \(\eta_t\) is the pre-tax time at time \(t\), that household receives from renting capital to the firm in period \(t\), and @w<sub>t</sub>@ is the pre-tax labor wage.
</p>

<p>
In equilibrium the household faces the budget constraint
</p>

<p>
$$\sum_{t=0}^{\infty} q_t \{(1 + \tau_{ct})c_t + [k_{t+1} - (1 - \delta)k_t]\} \le \sum_{t=0}^{\infty} q_t \{ \eta_t k_t - \tau_{kt}(\eta_t  - \delta_t)k_t + (1 - \tau_{nt})w_t n_t - \tau_{ht}\}$$
</p>

<p>
The government has a budget constraint $$\sum_{t=0}^{\infty} q_t g_t \le \sum_{t=0}^{\infty} q_t \{ \tau_{ct}c_T + \tau_{kt}(\eta_t - \delta) k_t + \tau_{nt} w_t n_t + \tau_{ht}\}$$
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Term structure of interest rates</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The prices system \(\{q_t\}_{t=0}^{\infty}\) evidently embeds within it a term structure of interest rates. It is convenient to represent \(q_t\) as
</p>

\begin{align}
q_t &= q_0 \frac{q_1}{1_0} \frac{q_2}{q_1} \cdots \frac{q_t}{q_{t-1}} \\
&= q_0 m_{0, 1} m_{0, 2} \cdots m_{t-1, t}
\end{align}

<p>
where \(m_{t, t+1} = \frac{q_{t+1}}{q_t}\). We can represent the one-period discount factor \(m_{t, t+1}\) as $$m_{t, t+1} = R_{t, t+1}^{-1} = \frac{1}{1 + r_{t, t+1}} \approx \exp(-r_{t, t+1})$$
</p>

<p>
THERE IS MUCH MORE IN THE BOOK, BUT I HAVE PRETTY MUCH BEEN WRITING EVERYTHING AND THAT IS DUMB
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><a id="ID-465B4AC3-AE20-4255-A252-CCABA15ECC0F" name="ID-465B4AC3-AE20-4255-A252-CCABA15ECC0F"></a><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Marching Orders, number 1 <code>[4/4]</code></h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption align="above"><span class="table-number">Table 1:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2013-07-18 Thu 00:36]</span></span></caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Headline</th>
<th scope="col" class="left">Time</th>
<th scope="col" class="right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Total time</b></td>
<td class="left"><b>1d 6:46</b></td>
<td class="right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">DONE [#A] Marching Orders, number 1&#x2026;</td>
<td class="left">1d 6:46</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left">\__ DONE [#A] Read Chapter 2 of RMT4</td>
<td class="left">&#xa0;</td>
<td class="right">17:42</td>
</tr>

<tr>
<td class="left">\__ DONE [#B] Read the two techincal&#x2026;</td>
<td class="left">&#xa0;</td>
<td class="right">1:13</td>
</tr>

<tr>
<td class="left">\__ DONE [#A] Work exercises 2.1-2.5</td>
<td class="left">&#xa0;</td>
<td class="right">11:51</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><a id="ID-760A6784-366A-4821-93C7-2CEAFB536B46" name="ID-760A6784-366A-4821-93C7-2CEAFB536B46"></a><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Read Chapter 2 of RMT4</h3>
<div class="outline-text-3" id="text-2-1">

<p>
I should probably look over section 2.4.5.2 again. It was a bit
complicated and I couldn't replicate its results on my own.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><a id="ID-39103168-00D5-4C92-A89B-28735E991612" name="ID-39103168-00D5-4C92-A89B-28735E991612"></a><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Read the two techincal appendixes</h3>
<div class="outline-text-3" id="text-2-2">
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><a id="ID-A9654E4F-F041-40C0-B858-2AC5372AA8D2" name="ID-A9654E4F-F041-40C0-B858-2AC5372AA8D2"></a><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> Work exercises 2.1-2.5</h3>
<div class="outline-text-3" id="text-2-3">
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><a id="ID-1B53EA77-B3C1-4564-AEFD-60DC37A6B19D" name="ID-1B53EA77-B3C1-4564-AEFD-60DC37A6B19D"></a><span class="section-number-3">2.4</span> <span class="done DONE">DONE</span> Think of python examples</h3>
<div class="outline-text-3" id="text-2-4">
</div>

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><a id="ID-804E4C2C-BE54-4DD8-AB4A-7F8D22676AED" name="ID-804E4C2C-BE54-4DD8-AB4A-7F8D22676AED"></a><span class="section-number-4">2.4.1</span> <span class="todo HOLD">HOLD</span> Re-create <code>markov.m</code> and other Matlab programs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="WAITING">WAITING</span>&#xa0;<span class="HOLD">HOLD</span></span></h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>State "HOLD"       from "WAITING"    <span class="timestamp-wrapper"><span class="timestamp">[2013-07-13 Sat 09:55]</span></span> <br  />
  Talk with Tom about this first
</li>
</ul>
</div>
</div>
