sargent.org
*** HOLD Add Baysean estimation to dolo.                     :WAITING:HOLD:
- State "HOLD"       from ""           [2013-07-13 Sat 09:56] \\
  Talk to Tom about this first
:PROPERTIES:
:ID:       ED5A9CBF-F975-4211-A0F2-BB1DA8767C37
:END:
* Other Tasks
:PROPERTIES:
:ID:       85994194-6129-47F0-8A82-CDBD953937C1
:END:
:ID:       52FF1153-D302-45E5-8D10-C24FA0BF9766
:END:
* TODO z-transform  [1/2]                                               :TOM:
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2013-07-18 Thu 12:07]
| Headline                           | Time    |       |
|------------------------------------+---------+-------|
| *Total time*                       | *14:40* |       |
|------------------------------------+---------+-------|
| TODO z-transform  [1/2]            | 14:40   |       |
| \__ DONE Read Z-transform document |         |  3:40 |
| \__ TODO Teaching module           |         | 10:49 |
#+END:

Tom asked us to read [[/Users/sglyon/School/NYU/NYUclasses/Sargent/ZTransform.pdf][ZTransform.pdf]] in this [[https://mail.google.com/mail/u/0/#inbox/13fca56945575292][email]].
CLOCK: [2013-07-10 Wed 23:20]--[2013-07-10 Wed 23:31] =>  0:11
:PROPERTIES:
:ID:       2016BB11-A846-44F1-821F-8ACB73DE0146
:END:
[2013-07-10 Wed 23:20]
** DONE Read Z-transform document                                  :READING:
CLOSED: [2013-07-16 Tue 12:18] SCHEDULED: <2013-07-12 Fri>
CLOCK: [2013-07-15 Mon 09:20]--[2013-07-15 Mon 10:13] =>  0:53
CLOCK: [2013-07-13 Sat 00:00]--[2013-07-13 Sat 00:05] =>  0:05
CLOCK: [2013-07-12 Fri 10:08]--[2013-07-12 Fri 10:59] =>  0:51
CLOCK: [2013-07-12 Fri 08:45]--[2013-07-12 Fri 09:33] =>  0:48
CLOCK: [2013-07-12 Fri 00:08]--[2013-07-12 Fri 00:24] =>  0:16
:PROPERTIES:
:ID:       5C001ED4-2035-4019-9761-0D8FE34591DF
:END:
*** Notes                                                           :NOTES:
- Definition of *the one sided z-transform*: $$X(z) = \sum_{k=0} x(k) z^{-k}$$ where the complex variable $z$ is selected to ensure that the summation converges.
- Look at the [[http://www.mathworks.com/help/symbolic/compute-z-transforms-and-inverse-z-transforms.html][rabbit problem]] for an example to include
*** TODO Tom's PV Notes                                             :NOTES:

Left of on page 24. He is finally getting to PV stuff with z-transform.

CLOCK: [2013-07-15 Mon 11:06]--[2013-07-15 Mon 11:53] =>  0:47
:PROPERTIES:
:ID:       C591CE6F-47B8-4449-8CC4-D35B6D0213CA
:END:


** TODO Teaching module                                       :CHASE:PYTHON:
CLOCK: [2013-07-18 Thu 14:38]--[2013-07-18 Thu 15:47] =>  1:09
CLOCK: [2013-07-18 Thu 10:16]--[2013-07-18 Thu 12:07] =>  1:51
CLOCK: [2013-07-17 Wed 09:50]--[2013-07-17 Wed 11:58] =>  2:08
CLOCK: [2013-07-16 Tue 14:40]--[2013-07-16 Tue 15:18] =>  0:38
CLOCK: [2013-07-16 Tue 13:11]--[2013-07-16 Tue 13:41] =>  0:30
CLOCK: [2013-07-16 Tue 08:09]--[2013-07-16 Tue 13:41] =>  5:32
CLOCK: [2013-07-15 Mon 09:03]--[2013-07-15 Mon 09:13] =>  0:10
:PROPERTIES:
:ID:       5A16242D-26A1-455D-A976-ACBAF4DDD83D
:END:

Quote from Tom's email:

 #+BEGIN_QUOTE
 Dear Chase and Spencer,

 I am attaching a document on Z-transforms.

 I want you to read this quickly, then get to work to make a two-part python demo (with a description in a *.rst file for me) that "teaches" the basics of z-transforms (without proofs -- just properties of z-transforms).  I want you to prepare a module that teaches how to use them to:

 a) compute present values, and

 b) solve linear difference equations.

 The scipy.signal facility has much of what you need.  Start with page 455 of the scipy manual please.

 Once you get familiar with z-transforms I'll ask you to do some things such as to get partial fractions decompositions and also to compute residues of some functions that I'll tell you about later.

 As for the elementary material on present values, if you go to my web page, the teaching section, you'll find some handwritten notes for an undergraduate macro class. One of the first lectures talks about using z-transforms to compute present values of discrete time sequences.

 (Later we might use Laplace transforms -- also in scipy -- to compute present values of continuous time functions).

 I realize that  my instructions are a little vague, but feel free to be creative.

 Very soon, I'll send you a request for another python project that is much more tightly specified.

 How is your reading going?

 Tom make a two-part python demo (with a description in a *.rst file for me) that "teaches" the basics of z-transforms (without proofs -- just properties of z-transforms).  I want you to prepare a module that teaches how to use them to:

 a) compute present values, and
 b) solve linear difference equations.

 The scipy.signal facility has much of what you need.  Start with page 455 of the scipy manual please.
 #+END_QUOTE

More information on present value calculations can be found in Tom's [[~/Downloads/TSUndergradMacroNotes.pdf][notes]] from an undergraduate macro course he taught.
* TODO Dynare -> python = dolo [0/2]                                    :TOM:
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2013-07-11 Thu 10:18]
| Headline                           | Time   |
|------------------------------------+--------|
| *Total time*                       | *0:03* |
|------------------------------------+--------|
| TODO Dynare -> python = dolo [0/2] | 0:03   |
#+END:

CLOCK: [2013-07-11 Thu 10:09]--[2013-07-11 Thu 10:12] =>  0:03
:PROPERTIES:
:ID:       0245B38D-36D2-4218-8DC2-36334FF6EF7C
:END:
[2013-07-11 Thu 10:09]
[[file:~/School/NYU/NYUclasses/Sargent/sargent.org::*z-transform][z-transform  {0/2}]]
** TODO Read RMT4 chapter 11
:PROPERTIES:
:ID:       EED6D755-89E1-4048-8EB8-7D16A4A59F4A
:END:
Tom asked us to read RMT4 [[~/School/NYU/NYUclasses/Sargent/Summer2013/Refs/RMT4_ch11.pdf][chapter 11]] of RMT4 and pay special attention to how to do Matlab examples in python
** TODO Matlab+Dynare -> python+dolo                          :PYTHON:CHASE:
:PROPERTIES:
:ID:       C3DB9A5A-70CD-40B3-B40F-676D87665811
:END:
Just do some dolo-fu on this and call it good
