sargent.html
<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><a id="ID-ED5A9CBF-F975-4211-A0F2-BB1DA8767C37" name="ID-ED5A9CBF-F975-4211-A0F2-BB1DA8767C37"></a><span class="section-number-4">2.4.2</span> <span class="todo HOLD">HOLD</span> Add Baysean estimation to dolo.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="WAITING">WAITING</span>&#xa0;<span class="HOLD">HOLD</span></span></h4>
<div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li>State "HOLD"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2013-07-13 Sat 09:56]</span></span> <br  />
  Talk to Tom about this first
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><a id="ID-85994194-6129-47F0-8A82-CDBD953937C1" name="ID-85994194-6129-47F0-8A82-CDBD953937C1"></a><span class="section-number-2">3</span> Other Tasks</h2>
<div class="outline-text-2" id="text-3">
<p>
:ID:       52FF1153-D302-45E5-8D10-C24FA0BF9766
:END:
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><a id="ID-2016BB11-A846-44F1-821F-8ACB73DE0146" name="ID-2016BB11-A846-44F1-821F-8ACB73DE0146"></a><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> z-transform  <code>[1/2]</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOM">TOM</span></span></h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption align="above"><span class="table-number">Table 2:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2013-07-18 Thu 12:07]</span></span></caption>

<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Headline</th>
<th scope="col" class="right">Time</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Total time</b></td>
<td class="right"><b>14:40</b></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">TODO z-transform  [1/2]</td>
<td class="right">14:40</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">\__ DONE Read Z-transform document</td>
<td class="right">&#xa0;</td>
<td class="left">3:40</td>
</tr>

<tr>
<td class="left">\__ TODO Teaching module</td>
<td class="right">&#xa0;</td>
<td class="left">10:49</td>
</tr>
</tbody>
</table>

<p>
Tom asked us to read <a href="file:///Users/sglyon/School/NYU/NYUclasses/Sargent/ZTransform.pdf">ZTransform.pdf</a> in this <a href="https://mail.google.com/mail/u/0/#inbox/13fca56945575292">email</a>.
</p>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2013-07-10 Wed 23:20]</span></span>
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><a id="ID-5C001ED4-2035-4019-9761-0D8FE34591DF" name="ID-5C001ED4-2035-4019-9761-0D8FE34591DF"></a><span class="section-number-3">4.1</span> <span class="done DONE">DONE</span> Read Z-transform document&#xa0;&#xa0;&#xa0;<span class="tag"><span class="READING">READING</span></span></h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Notes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="NOTES">NOTES</span></span></h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>Definition of <b>the one sided z-transform</b>: $$X(z) = \sum_{k=0} x(k) z^{-k}$$ where the complex variable \(z\) is selected to ensure that the summation converges.
</li>
<li>Look at the <a href="http://www.mathworks.com/help/symbolic/compute-z-transforms-and-inverse-z-transforms.html">rabbit problem</a> for an example to include
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><a id="ID-C591CE6F-47B8-4449-8CC4-D35B6D0213CA" name="ID-C591CE6F-47B8-4449-8CC4-D35B6D0213CA"></a><span class="section-number-4">4.1.2</span> <span class="todo TODO">TODO</span> Tom's PV Notes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="NOTES">NOTES</span></span></h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Left of on page 24. He is finally getting to PV stuff with z-transform.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><a id="ID-5A16242D-26A1-455D-A976-ACBAF4DDD83D" name="ID-5A16242D-26A1-455D-A976-ACBAF4DDD83D"></a><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Teaching module&#xa0;&#xa0;&#xa0;<span class="tag"><span class="CHASE">CHASE</span>&#xa0;<span class="PYTHON">PYTHON</span></span></h3>
<div class="outline-text-3" id="text-4-2">

<p>
Quote from Tom's email:
</p>

<blockquote>
<p>
Dear Chase and Spencer,
</p>

<p>
I am attaching a document on Z-transforms.
</p>

<p>
I want you to read this quickly, then get to work to make a two-part python demo (with a description in a *.rst file for me) that "teaches" the basics of z-transforms (without proofs &#x2013; just properties of z-transforms).  I want you to prepare a module that teaches how to use them to:
</p>

<p>
a) compute present values, and
</p>

<p>
b) solve linear difference equations.
</p>

<p>
The scipy.signal facility has much of what you need.  Start with page 455 of the scipy manual please.
</p>

<p>
Once you get familiar with z-transforms I'll ask you to do some things such as to get partial fractions decompositions and also to compute residues of some functions that I'll tell you about later.
</p>

<p>
As for the elementary material on present values, if you go to my web page, the teaching section, you'll find some handwritten notes for an undergraduate macro class. One of the first lectures talks about using z-transforms to compute present values of discrete time sequences.
</p>

<p>
(Later we might use Laplace transforms &#x2013; also in scipy &#x2013; to compute present values of continuous time functions).
</p>

<p>
I realize that  my instructions are a little vague, but feel free to be creative.
</p>

<p>
Very soon, I'll send you a request for another python project that is much more tightly specified.
</p>

<p>
How is your reading going?
</p>

<p>
Tom make a two-part python demo (with a description in a *.rst file for me) that "teaches" the basics of z-transforms (without proofs &#x2013; just properties of z-transforms).  I want you to prepare a module that teaches how to use them to:
</p>

<p>
a) compute present values, and
b) solve linear difference equations.
</p>

<p>
The scipy.signal facility has much of what you need.  Start with page 455 of the scipy manual please.
</p>
</blockquote>

<p>
More information on present value calculations can be found in Tom's <a href="file:///Users/sglyon/Downloads/TSUndergradMacroNotes.pdf">notes</a> from an undergraduate macro course he taught.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><a id="ID-0245B38D-36D2-4218-8DC2-36334FF6EF7C" name="ID-0245B38D-36D2-4218-8DC2-36334FF6EF7C"></a><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Dynare -&gt; python = dolo <code>[0/2]</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOM">TOM</span></span></h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption align="above"><span class="table-number">Table 3:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2013-07-11 Thu 10:18]</span></span></caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Headline</th>
<th scope="col" class="left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><b>Total time</b></td>
<td class="left"><b>0:03</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">TODO Dynare -&gt; python = dolo [0/2]</td>
<td class="left">0:03</td>
</tr>
</tbody>
</table>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2013-07-11 Thu 10:09]</span></span>
<a href="file:///Users/sglyon/School/NYU/NYUclasses/Sargent/sargent.html">z-transform  {0/2}</a>
</p>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><a id="ID-EED6D755-89E1-4048-8EB8-7D16A4A59F4A" name="ID-EED6D755-89E1-4048-8EB8-7D16A4A59F4A"></a><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Read RMT4 chapter 11</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Tom asked us to read RMT4 <a href="file:///Users/sglyon/School/NYU/NYUclasses/Sargent/Summer2013/Refs/RMT4_ch11.pdf">chapter 11</a> of RMT4 and pay special attention to how to do Matlab examples in python
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><a id="ID-C3DB9A5A-70CD-40B3-B40F-676D87665811" name="ID-C3DB9A5A-70CD-40B3-B40F-676D87665811"></a><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> Matlab+Dynare -&gt; python+dolo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PYTHON">PYTHON</span>&#xa0;<span class="CHASE">CHASE</span></span></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Just do some dolo-fu on this and call it good
</p>
</div>
</div>
</div>
