sargent.org
* TODO Marching orders, number 2                                        :TOM:
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2013-07-18 Thu 00:35]
| Headline                                  | Time   |      |
|-------------------------------------------+--------+------|
| *Total time*                              | *0:37* |      |
|-------------------------------------------+--------+------|
| TODO Marching orders, number 2            | 0:37   |      |
| \__ TODO Work problems RMT4 2.6, 2.10.... |        | 0:35 |
#+END:

CLOCK: [2013-07-17 Wed 14:06]--[2013-07-17 Wed 14:08] =>  0:02
:PROPERTIES:
:ID:       B63EE52B-DFDC-4838-B5ED-4404907FDD95
:END:
[2013-07-17 Wed 14:06]
[[file:~/Dropbox/org/xdress.org::*Enum%20support%20in%20xdress][Enum support in xdress]]
** TODO Read [[file:~/School/NYU/NYUclasses/Sargent/Summer2013/Refs/RMT4_ch11.pdf][RMT4 Chapter 11]]                                       :READING:
CLOCK: [2013-07-20 Sat 09:53]--[2013-07-20 Sat 10:54] =>  1:01
CLOCK: [2013-07-20 Sat 08:50]--[2013-07-20 Sat 09:13] =>  0:23
CLOCK: [2013-07-20 Sat 08:50]--[2013-07-20 Sat 08:50] =>  0:00
CLOCK: [2013-07-19 Fri 19:37]--[2013-07-19 Fri 19:57] =>  0:20
:PROPERTIES:
:ID:       D7454813-A217-42CD-A074-1599BF68C827
:END:
** TODO Work problems RMT4 2.6, 2.10. 2.14, 2.17, 2.20, 2.24            :HW:
CLOCK: [2013-07-20 Sat 23:09]--[2013-07-20 Sat 23:34] =>  0:25
CLOCK: [2013-07-20 Sat 22:29]--[2013-07-20 Sat 22:59] =>  0:30
CLOCK: [2013-07-20 Sat 16:45]--[2013-07-20 Sat 17:12] =>  0:27
CLOCK: [2013-07-20 Sat 15:29]--[2013-07-20 Sat 16:36] =>  1:07
CLOCK: [2013-07-20 Sat 13:49]--[2013-07-20 Sat 14:10] =>  0:21
CLOCK: [2013-07-20 Sat 11:51]--[2013-07-20 Sat 12:17] =>  0:26
CLOCK: [2013-07-18 Thu 00:00]--[2013-07-18 Thu 00:35] =>  0:35
:PROPERTIES:
:ID:       CD33EBD9-6E07-4890-9537-B7C1A314C826
:END:
** TODO Replicate figure 11.9.1 in RMT4 (page 401)                  :PYTHON:
:PROPERTIES:
:ID:       45296A34-EA73-47F2-82C2-396F988ABCB7
:END:
